In [3]:
import numpy as np
import pandas as pd

In [4]:
# List of Tuples
students = [ 
    ('jack', np.NaN, 'Sydeny' , 'Australia') ,
    ('Riti', np.NaN, 'Delhi' , 'India' ) ,
    ('Vikas', 31, np.NaN , 'India' ) ,
    ('Neelu', 32, 'Bangalore' , 'India' ) ,
    ('John', 16, 'New York' , 'US') ,
    ('John' , 11, np.NaN, np.NaN ) ,
    (np.NaN , np.NaN, np.NaN, np.NaN ) 
]
    
#Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'])

In [5]:
dfObj

    Name   Age       City    Country
0   jack   NaN     Sydeny  Australia
1   Riti   NaN      Delhi      India
2  Vikas  31.0        NaN      India
3  Neelu  32.0  Bangalore      India
4   John  16.0   New York         US
5   John  11.0        NaN        NaN
6    NaN   NaN        NaN        NaN

In [6]:
dfObj.isnull()

    Name    Age   City  Country
0  False   True  False    False
1  False   True  False    False
2  False  False   True    False
3  False  False  False    False
4  False  False  False    False
5  False  False   True     True
6   True   True   True     True

In [7]:
dfObj.isnull().sum()

Name       1
Age        3
City       3
Country    2
dtype: int64

In [9]:
dfObj.isnull().sum(axis=1)

0    1
1    1
2    1
3    0
4    0
5    2
6    4
dtype: int64